// 5) Реализуйте класс с менюшкой и  публичные методы
//    getElem -возвращает елемент в котором генерится меню;
//     toggle открыть/закрыть элемент меню по метке;
//     close закрыть элемент меню по метке;
//     open открыть элемент меню по метке
//
// в интерфейсе реализуйте кнопками вызов этих методов ( например над меню)
// P.S. для демонстрации

class Menu {
    public getElem():string{
      return '';
    }
    public toggle(){

    }
    public close(){

    }
    public open(){

    }
    public constructor() {}
}
